<template>
  <div style="min-height: 100vh">
    <div v-if="mainCar" class="main-car-page container">
      <div class="car-details">
        <div class="images-text">
          <div class="row">
            <div class="col-12 col-xl-6 col-lg-6">
              <div class="header mobile">
                  <div class="vendor">
                    <div>
                      <div class="vendor-icon">
                        <img src="@/assets/images/vendor-icon.svg" alt="" />
                        <span> متجر كود كار </span>
                        <svg
                          xmlns="http://www.w3.org/2000/svg"
                          width="16"
                          height="16"
                          viewBox="0 0 16 16"
                          fill="none"
                        >
                          <path
                            d="M15.6513 8.18343C15.7969 7.98193 15.9002 7.75247 15.9549 7.50913C16.0096 7.2658 16.0146 7.01372 15.9696 6.76836C15.9285 6.5213 15.8384 6.28518 15.7049 6.07418C15.5714 5.86318 15.3971 5.68165 15.1925 5.54047L14.1119 4.79924C14.067 4.76794 14.0297 4.72676 14.0028 4.67878C13.9759 4.6308 13.9601 4.57727 13.9565 4.52222L13.8603 3.21197C13.8429 2.9622 13.7756 2.71861 13.6623 2.49596C13.5491 2.27331 13.3924 2.07624 13.2016 1.9167C13.0124 1.7551 12.7931 1.63344 12.5567 1.55886C12.3203 1.48428 12.0716 1.4583 11.8251 1.48244L10.5373 1.61721C10.4815 1.6246 10.4248 1.61825 10.372 1.5987C10.3191 1.57915 10.2718 1.54697 10.2339 1.5049L9.32356 0.561525C9.15062 0.383693 8.94442 0.242459 8.71697 0.146054C8.48953 0.0496491 8.2454 0 7.9988 0C7.7522 0 7.50807 0.0496491 7.28063 0.146054C7.05319 0.242459 6.84699 0.383693 6.67404 0.561525L5.76373 1.5049C5.72583 1.54697 5.67845 1.57915 5.62562 1.5987C5.57279 1.61825 5.51607 1.6246 5.46029 1.61721L4.17253 1.48244C3.92627 1.45882 3.67783 1.485 3.44167 1.55944C3.2055 1.63389 2.98634 1.75512 2.79693 1.91608C2.60752 2.07703 2.45166 2.2745 2.33841 2.49698C2.22516 2.71946 2.15679 2.9625 2.13728 3.21197L2.04107 4.52222C2.03686 4.57898 2.02003 4.63405 1.99183 4.68332C1.96364 4.73258 1.92482 4.77477 1.87825 4.80673L0.805121 5.54796C0.601848 5.68878 0.428411 5.86925 0.294977 6.07877C0.161543 6.28829 0.0707977 6.52265 0.028061 6.76811C-0.0146758 7.01357 -0.00854412 7.26519 0.0460966 7.50823C0.100737 7.75126 0.202788 7.98081 0.346265 8.18343L1.10856 9.25409C1.14064 9.30032 1.16197 9.3533 1.17094 9.40905C1.17992 9.46481 1.1763 9.52189 1.16036 9.57603L0.805121 10.8414C0.739319 11.0826 0.721791 11.3346 0.753563 11.5827C0.785335 11.8309 0.865768 12.0701 0.990143 12.2864C1.11326 12.503 1.27832 12.6922 1.47543 12.8427C1.67254 12.9932 1.89765 13.1019 2.13728 13.1624L3.39544 13.4843C3.4493 13.498 3.49933 13.524 3.54167 13.5604C3.58401 13.5967 3.61754 13.6424 3.63967 13.694L4.17253 14.8919C4.27353 15.1206 4.41891 15.3265 4.60004 15.4973C4.78117 15.6681 4.99436 15.8004 5.22696 15.8863C5.45957 15.9721 5.70686 16.0099 5.95417 15.9973C6.20147 15.9847 6.44375 15.9219 6.66664 15.8128L7.83598 15.2438C7.88646 15.218 7.94223 15.2045 7.9988 15.2045C8.05537 15.2045 8.11115 15.218 8.16162 15.2438L9.33097 15.8128C9.57967 15.9364 9.85316 16.0005 10.1303 16C10.3472 15.9998 10.5625 15.9618 10.7667 15.8877C10.9996 15.801 11.2131 15.6684 11.3948 15.4974C11.5765 15.3264 11.7228 15.1206 11.8251 14.8919L12.3579 13.694C12.3801 13.6424 12.4136 13.5967 12.4559 13.5604C12.4983 13.524 12.5483 13.498 12.6022 13.4843L13.8603 13.1624C14.0999 13.1013 14.3249 12.9923 14.5221 12.8416C14.7192 12.691 14.8845 12.5018 15.008 12.2854C15.1316 12.0689 15.2109 11.8296 15.2413 11.5815C15.2717 11.3335 15.2526 11.0818 15.1851 10.8414L14.8372 9.57603C14.8213 9.52189 14.8177 9.46481 14.8267 9.40905C14.8356 9.3533 14.857 9.30032 14.889 9.25409L15.6513 8.18343ZM11.381 6.79082L7.947 10.2649C7.63936 10.5719 7.2246 10.744 6.79245 10.744C6.36031 10.744 5.94555 10.5719 5.63791 10.2649L4.61659 9.23163C4.54095 9.15637 4.48088 9.06664 4.43988 8.96766C4.39888 8.86868 4.37776 8.76244 4.37776 8.65512C4.37776 8.5478 4.39888 8.44155 4.43988 8.34257C4.48088 8.24359 4.54095 8.15386 4.61659 8.07861C4.76864 7.92746 4.97328 7.84276 5.18646 7.84276C5.39963 7.84276 5.60428 7.92746 5.75633 8.07861L6.77765 9.11183L10.2487 5.6378C10.3998 5.48589 10.6044 5.40095 10.8175 5.40165C11.0305 5.40235 11.2346 5.48865 11.3847 5.64155C11.5349 5.79445 11.6188 6.00143 11.6181 6.21696C11.6175 6.43249 11.5322 6.63891 11.381 6.79082Z"
                            fill="#5BCE97"
                          />
                        </svg>
                      </div>
                      <span class="city"> الرياض </span>
                    </div>
                    <div class="iconss d-flex align-items-center gap-3">
                      <div class="icon">
                        <img src="@/assets/images/call.svg" alt="" />
                      </div>
                      <div>
                     <svg xmlns="http://www.w3.org/2000/svg" width="17" height="17" viewBox="0 0 17 17" fill="none">
    <path d="M0.285156 16.7086L1.42361 12.4933C0.721612 11.257 0.352378 9.85656 0.352637 8.43139C0.352637 3.95041 3.9452 0.300171 8.35533 0.300171C10.4973 0.300171 12.5043 1.14853 14.0219 2.68205C14.7677 3.43771 15.3587 4.33446 15.761 5.321C16.1632 6.30753 16.3689 7.36449 16.3663 8.43139C16.3663 12.9128 12.7742 16.5631 8.3636 16.5631C7.02316 16.5631 5.70751 16.22 4.53508 15.5692L0.285156 16.7086Z" fill="#38A3A5"/>
    <path d="M0 17L1.18069 12.6386C0.454793 11.3577 0.0739822 9.90701 0.0762031 8.43116C0.067481 3.77865 3.78628 0 8.35709 0C10.5748 0 12.6575 0.873851 14.2261 2.46764C15.7947 4.06144 16.6545 6.17769 16.6545 8.43116C16.6545 13.0753 12.9362 16.8544 8.36535 16.8544C6.97942 16.8563 5.61576 16.5024 4.40233 15.8262L0 17ZM4.59651 14.3094L4.84945 14.4637C5.91052 15.1021 7.12247 15.4395 8.35755 15.4405C12.1521 15.4405 15.247 12.2956 15.247 8.43997C15.247 6.57173 14.5305 4.80688 13.2318 3.48706C11.9322 2.16817 10.1951 1.43108 8.35663 1.43108C4.55336 1.43108 1.45842 4.57601 1.45842 8.43162C1.45842 9.75144 1.82107 11.0453 2.51286 12.1588L2.67307 12.4249L1.97302 15.0126L4.59559 14.3098L4.59651 14.3094Z" fill="white"/>
    <path fill-rule="evenodd" clip-rule="evenodd" d="M6.29084 4.90099C6.13935 4.54959 5.97042 4.54125 5.82719 4.54125C5.70049 4.53244 5.56553 4.53244 5.42231 4.53244C5.28734 4.53244 5.05965 4.5839 4.86593 4.79807C4.67175 5.01225 4.14062 5.51801 4.14062 6.55505C4.14062 7.59162 4.88292 8.59434 4.98391 8.7311C5.0849 8.86832 6.41754 11.062 8.52551 11.9103C10.2796 12.6127 10.634 12.4759 11.0136 12.4328C11.3928 12.3901 12.2361 11.9275 12.4132 11.4301C12.5817 10.9419 12.5817 10.5136 12.5312 10.4278C12.4807 10.342 12.337 10.2906 12.1346 10.1793C11.9239 10.0764 10.9121 9.56277 10.718 9.49369C10.5242 9.42508 10.3893 9.39078 10.2543 9.59661C10.1194 9.81078 9.72319 10.2822 9.59649 10.419C9.47851 10.5562 9.35227 10.5734 9.14983 10.4705C8.93866 10.368 8.27303 10.145 7.47979 9.42508C6.86466 8.86832 6.45151 8.17434 6.32481 7.96851C6.20683 7.75433 6.30782 7.64307 6.41754 7.54016C6.51026 7.44605 6.6287 7.29168 6.72969 7.17161C6.83068 7.05154 6.8642 6.95744 6.9404 6.82022C7.00788 6.68346 6.97391 6.55458 6.92341 6.45213C6.87292 6.35756 6.47629 5.32099 6.29084 4.90099Z" fill="white"/>
  </svg>
                      </div>
                    </div>
                  </div>
                  <div>
                    <div class="icons">
                      <div class="icon">
                        <!-- <img src="@/assets/images/share-icon.svg" alt="" /> -->
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
    <path fill-rule="evenodd" clip-rule="evenodd" d="M19.2233 5.28C19.2233 3.95452 18.1488 2.88 16.8233 2.88C15.4978 2.88 14.4233 3.95452 14.4233 5.28C14.4233 6.60549 15.4978 7.68 16.8233 7.68C18.1488 7.68 19.2233 6.60549 19.2233 5.28ZM19.2233 17.76C19.2233 16.4345 18.1488 15.36 16.8233 15.36C15.4978 15.36 14.4233 16.4345 14.4233 17.76C14.4233 19.0855 15.4978 20.16 16.8233 20.16C18.1488 20.16 19.2233 19.0855 19.2233 17.76ZM6.26328 9.60001C7.58876 9.60001 8.66328 10.6745 8.66328 12C8.66328 13.3255 7.58876 14.4 6.26328 14.4C4.9378 14.4 3.86328 13.3255 3.86328 12C3.86328 10.6745 4.9378 9.60001 6.26328 9.60001ZM13.6341 6.34055C13.7366 6.64885 13.8825 6.93731 14.0646 7.19868L8.7806 9.77448C8.54693 9.51038 8.27234 9.28331 7.96676 9.10322L13.6341 6.34055ZM13.6647 16.6115C13.5531 16.9184 13.4849 17.2462 13.4676 17.5874L8.04526 14.8491C8.34052 14.664 8.60496 14.4343 8.82912 14.1695L13.6647 16.6115Z" fill="#90A3BF"/>
  </svg>
                      </div>
                      <div class="icon">
                        <!-- <img src="@/assets/images/fav.svg" alt="" /> -->
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.3812 6.13407C14.1606 4.35529 17.0457 4.35529 18.8252 6.13407C20.6047 7.91296 20.6047 10.7972 18.8252 12.5761L12.3392 19.0595C12.1518 19.2468 11.8479 19.2468 11.6605 19.0595L5.17453 12.5761C3.39495 10.7972 3.39495 7.91296 5.17453 6.13407C6.95401 4.35529 9.83904 4.35529 11.6185 6.13407L11.9998 6.51524L12.3812 6.13407Z" fill="#90A3BF"/>
  </svg>
                      </div>
                    </div>
                  </div>
                </div>
            <div class="main-images">
              <swiper
                :style="{
                  '--swiper-navigation-color': '#fff',
                  '--swiper-pagination-color': '#fff',
                }"
                :loop="true"
                :spaceBetween="10"
                :thumbs="{ swiper: thumbsSwiper }"
                :modules="[SwiperFreeMode, SwiperThumbs]"
                class="mySwiper2"
              >
                <swiper-slide v-for="image in mainCar.images">
                <div class="image">
                <img :src="image" alt="">
                
                </div>
                  <div @click="showMultiple" class="zoom">
                    <img src="~/assets/images/zoom.svg" alt="" />
                  </div>
                </swiper-slide>
        
              </swiper>
              <div class="d-flex align-items-center gap-3 mt-3">
                <div class="slider__prev">
                  <img src="~/assets/images/arrow-right.svg" alt="" />
                </div>
                <swiper
                  @swiper="setThumbsSwiper"
                  :loop="true"
                  :spaceBetween="10"
                  :freeMode="true"
                  :watchSlidesProgress="true"
                  :navigation="{
                    nextEl: '.slider__next',
                    prevEl: '.slider__prev',
                  }"
                  :breakpoints="{
                    '300': {
                      slidesPerView: 3.2,
                      spaceBetween: 20,
                    },
                    '768': {
                      slidesPerView: 4,
                      spaceBetween: 10,
                    },
                    '1024': {
                      slidesPerView: 5,
                      spaceBetween: 20,
                    },
                  }"
                  :modules="[SwiperNavigation]"
                  class="mySwiper"
                >
                  <swiper-slide v-for="image in mainCar.images" :class="{'auto-width': mainCar.images.length <= 4}">
                    <div class="image">
                     <img :src="image" alt="">
                    </div>
                  </swiper-slide>
                </swiper>
                <div class="slider__next">
                  <img src="~/assets/images/arrow-left.svg" alt="" />
                </div>
              </div>
            
            </div>
            </div>
            <vue-easy-lightbox
              :visible="visibleRef"
              :imgs="imgsRef"
              :index="indexRef"
              @hide="onHide"
            ></vue-easy-lightbox>
            <div class="col-12 col-xl-6 col-lg-6">
            <div>
              <div class="header desc">
                <div class="vendor">
                  <div>
                    <div class="vendor-icon">
                      <img src="@/assets/images/vendor-icon.svg" alt="" />
                      <!-- <img :src="mainCar.vendor.image" alt="" /> -->
                      <!-- <span> متجر كود كار </span> -->
                      <span> {{ mainCar.vendor.name }} </span>
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="16"
                        height="16"
                        viewBox="0 0 16 16"
                        fill="none"
                      >
                        <path
                          d="M15.6513 8.18343C15.7969 7.98193 15.9002 7.75247 15.9549 7.50913C16.0096 7.2658 16.0146 7.01372 15.9696 6.76836C15.9285 6.5213 15.8384 6.28518 15.7049 6.07418C15.5714 5.86318 15.3971 5.68165 15.1925 5.54047L14.1119 4.79924C14.067 4.76794 14.0297 4.72676 14.0028 4.67878C13.9759 4.6308 13.9601 4.57727 13.9565 4.52222L13.8603 3.21197C13.8429 2.9622 13.7756 2.71861 13.6623 2.49596C13.5491 2.27331 13.3924 2.07624 13.2016 1.9167C13.0124 1.7551 12.7931 1.63344 12.5567 1.55886C12.3203 1.48428 12.0716 1.4583 11.8251 1.48244L10.5373 1.61721C10.4815 1.6246 10.4248 1.61825 10.372 1.5987C10.3191 1.57915 10.2718 1.54697 10.2339 1.5049L9.32356 0.561525C9.15062 0.383693 8.94442 0.242459 8.71697 0.146054C8.48953 0.0496491 8.2454 0 7.9988 0C7.7522 0 7.50807 0.0496491 7.28063 0.146054C7.05319 0.242459 6.84699 0.383693 6.67404 0.561525L5.76373 1.5049C5.72583 1.54697 5.67845 1.57915 5.62562 1.5987C5.57279 1.61825 5.51607 1.6246 5.46029 1.61721L4.17253 1.48244C3.92627 1.45882 3.67783 1.485 3.44167 1.55944C3.2055 1.63389 2.98634 1.75512 2.79693 1.91608C2.60752 2.07703 2.45166 2.2745 2.33841 2.49698C2.22516 2.71946 2.15679 2.9625 2.13728 3.21197L2.04107 4.52222C2.03686 4.57898 2.02003 4.63405 1.99183 4.68332C1.96364 4.73258 1.92482 4.77477 1.87825 4.80673L0.805121 5.54796C0.601848 5.68878 0.428411 5.86925 0.294977 6.07877C0.161543 6.28829 0.0707977 6.52265 0.028061 6.76811C-0.0146758 7.01357 -0.00854412 7.26519 0.0460966 7.50823C0.100737 7.75126 0.202788 7.98081 0.346265 8.18343L1.10856 9.25409C1.14064 9.30032 1.16197 9.3533 1.17094 9.40905C1.17992 9.46481 1.1763 9.52189 1.16036 9.57603L0.805121 10.8414C0.739319 11.0826 0.721791 11.3346 0.753563 11.5827C0.785335 11.8309 0.865768 12.0701 0.990143 12.2864C1.11326 12.503 1.27832 12.6922 1.47543 12.8427C1.67254 12.9932 1.89765 13.1019 2.13728 13.1624L3.39544 13.4843C3.4493 13.498 3.49933 13.524 3.54167 13.5604C3.58401 13.5967 3.61754 13.6424 3.63967 13.694L4.17253 14.8919C4.27353 15.1206 4.41891 15.3265 4.60004 15.4973C4.78117 15.6681 4.99436 15.8004 5.22696 15.8863C5.45957 15.9721 5.70686 16.0099 5.95417 15.9973C6.20147 15.9847 6.44375 15.9219 6.66664 15.8128L7.83598 15.2438C7.88646 15.218 7.94223 15.2045 7.9988 15.2045C8.05537 15.2045 8.11115 15.218 8.16162 15.2438L9.33097 15.8128C9.57967 15.9364 9.85316 16.0005 10.1303 16C10.3472 15.9998 10.5625 15.9618 10.7667 15.8877C10.9996 15.801 11.2131 15.6684 11.3948 15.4974C11.5765 15.3264 11.7228 15.1206 11.8251 14.8919L12.3579 13.694C12.3801 13.6424 12.4136 13.5967 12.4559 13.5604C12.4983 13.524 12.5483 13.498 12.6022 13.4843L13.8603 13.1624C14.0999 13.1013 14.3249 12.9923 14.5221 12.8416C14.7192 12.691 14.8845 12.5018 15.008 12.2854C15.1316 12.0689 15.2109 11.8296 15.2413 11.5815C15.2717 11.3335 15.2526 11.0818 15.1851 10.8414L14.8372 9.57603C14.8213 9.52189 14.8177 9.46481 14.8267 9.40905C14.8356 9.3533 14.857 9.30032 14.889 9.25409L15.6513 8.18343ZM11.381 6.79082L7.947 10.2649C7.63936 10.5719 7.2246 10.744 6.79245 10.744C6.36031 10.744 5.94555 10.5719 5.63791 10.2649L4.61659 9.23163C4.54095 9.15637 4.48088 9.06664 4.43988 8.96766C4.39888 8.86868 4.37776 8.76244 4.37776 8.65512C4.37776 8.5478 4.39888 8.44155 4.43988 8.34257C4.48088 8.24359 4.54095 8.15386 4.61659 8.07861C4.76864 7.92746 4.97328 7.84276 5.18646 7.84276C5.39963 7.84276 5.60428 7.92746 5.75633 8.07861L6.77765 9.11183L10.2487 5.6378C10.3998 5.48589 10.6044 5.40095 10.8175 5.40165C11.0305 5.40235 11.2346 5.48865 11.3847 5.64155C11.5349 5.79445 11.6188 6.00143 11.6181 6.21696C11.6175 6.43249 11.5322 6.63891 11.381 6.79082Z"
                          fill="#5BCE97"
                        />
                      </svg>
                    </div>
                    <span class="city"> {{ mainCar.vendor.city.name }} </span>
                  </div>
                  <div class="d-flex align-items-center gap-3">
                    <button data-bs-toggle="modal" data-bs-target="#vendor-phone-modal" class="icon">
                      <img src="@/assets/images/call.svg" alt="" />
                    </button>
                    <div>
                    <button data-bs-toggle="modal" data-bs-target="#vendor-whatsapp-modal">
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="28"
                        height="28"
                        viewBox="0 0 28 28"
                        fill="none"
                      >
                        <rect width="28" height="28" rx="14" fill="#E7F1F1" />
                        <path
                          d="M6.28711 22.7085L7.42556 18.4932C6.72357 17.2568 6.35433 15.8564 6.35459 14.4313C6.35459 9.95029 9.94715 6.30005 14.3573 6.30005C16.4992 6.30005 18.5062 7.1484 20.0239 8.68193C20.7697 9.43759 21.3606 10.3343 21.7629 11.3209C22.1652 12.3074 22.3709 13.3644 22.3682 14.4313C22.3682 18.9127 18.7761 22.563 14.3656 22.563C13.0251 22.563 11.7095 22.2199 10.537 21.569L6.28711 22.7085Z"
                          fill="#38A3A5"
                        />
                        <path
                          d="M6 23L7.18069 18.6386C6.45479 17.3577 6.07398 15.907 6.0762 14.4312C6.06748 9.77865 9.78628 6 14.3571 6C16.5748 6 18.6575 6.87385 20.2261 8.46764C21.7947 10.0614 22.6545 12.1777 22.6545 14.4312C22.6545 19.0753 18.9362 22.8544 14.3654 22.8544C12.9794 22.8563 11.6158 22.5024 10.4023 21.8262L6 23ZM10.5965 20.3094L10.8495 20.4637C11.9105 21.1021 13.1225 21.4395 14.3575 21.4405C18.1521 21.4405 21.247 18.2956 21.247 14.44C21.247 12.5717 20.5305 10.8069 19.2318 9.48706C17.9322 8.16817 16.1951 7.43108 14.3566 7.43108C10.5534 7.43108 7.45842 10.576 7.45842 14.4316C7.45842 15.7514 7.82107 17.0453 8.51286 18.1588L8.67307 18.4249L7.97302 21.0126L10.5956 20.3098L10.5965 20.3094Z"
                          fill="white"
                        />
                        <path
                          fill-rule="evenodd"
                          clip-rule="evenodd"
                          d="M12.2908 10.901C12.1393 10.5496 11.9704 10.5413 11.8272 10.5413C11.7005 10.5325 11.5655 10.5325 11.4223 10.5325C11.2873 10.5325 11.0597 10.5839 10.8659 10.7981C10.6718 11.0123 10.1406 11.518 10.1406 12.5551C10.1406 13.5916 10.8829 14.5944 10.9839 14.7311C11.0849 14.8684 12.4175 17.062 14.5255 17.9104C16.2796 18.6127 16.634 18.4759 17.0136 18.4328C17.3928 18.3902 18.2361 17.9275 18.4132 17.4301C18.5817 16.942 18.5817 16.5136 18.5312 16.4278C18.4807 16.3421 18.337 16.2906 18.1346 16.1794C17.9239 16.0764 16.9121 15.5628 16.718 15.4937C16.5242 15.4251 16.3893 15.3908 16.2543 15.5966C16.1194 15.8108 15.7232 16.2823 15.5965 16.419C15.4785 16.5563 15.3523 16.5734 15.1498 16.4705C14.9387 16.368 14.273 16.1451 13.4798 15.4251C12.8647 14.8684 12.4515 14.1744 12.3248 13.9685C12.2068 13.7544 12.3078 13.6431 12.4175 13.5402C12.5103 13.4461 12.6287 13.2917 12.7297 13.1716C12.8307 13.0516 12.8642 12.9575 12.9404 12.8202C13.0079 12.6835 12.9739 12.5546 12.9234 12.4522C12.8729 12.3576 12.4763 11.321 12.2908 10.901Z"
                          fill="white"
                        />
                      </svg>
                    
                    </button>
                    </div>
                  </div>
                </div>
                <div>
                  <div class="icons">
                    <div class="icon">
                      <img src="@/assets/images/share-icon.svg" alt="" />
                    </div>
                    <div class="icon">
                      <img src="@/assets/images/fav.svg" alt="" />
                    </div>
                  </div>
                </div>
              </div>
              <p class="time">{{$t('datee')}} {{ mainCar.publish_date }}</p>
              <div class="name">
                <h4>{{ mainCar.main_title }}</h4>
                <div class="model">
                  <span>{{ mainCar.statue }}</span>
                  <span>{{ mainCar.brand.title }}</span>
                  <!-- <img src="@/assets/images/brand1.png" alt="" /> -->
                  <span>{{ mainCar.model.title }}</span>
                </div>
              </div>
              <div class="description">
                <span class="word">{{$t('disc1')}}</span>
                <!-- <p>
                  استمتع بتجربة القيادة الفريدة مع هذه السيارة الفاخرة. تجمع
                  الأداء العالي والتصميم الأنيق في سيارة تضيف لمسة من الرفاهية
                  إلى رحلاتك اليومية. اكتشف قوة المحرك، والراحة في الداخل،
                  والتكنولوجيا المتقدمة التي تجعل هذه السيارة فريدة من نوعها
                  استمتع بتجربة القيادة الفريدة مع هذه السيارة الفاخرة. تجمع
                  الأداء العالي والتصميم الأنيق في سيارة تضيف لمسة من الرفاهية
                  إلى رحلاتك اليومية. اكتشف قوة المحرك، والراحة في الداخل،
                  والتكنولوجيا المتقدمة التي تجعل هذه السيارة فريدة من نوعها
                  استمتع بتجربة القيادة الفريدة مع هذه السيارة الفاخرة. تجمع
                  الأداء العالي والتصميم الأنيق في سيارة تضيف لمسة من الرفاهية
                  إلى رحلاتك اليومية. اكتشف قوة المحرك، والراحة في الداخل،
                  والتكنولوجيا المتقدمة التي تجعل هذه السيارة فريدة من نوعها
                </p> -->
                <div class="descDiv" v-html="mainCar.description"></div>
              </div>

              <div class="price">
                <span class="word">{{ $t('price') }}</span>
                <div class="main-price">
                  <h5>{{ mainCar.price }} {{$t('curr')}}</h5>
                  <span v-if="discount_price" class="disc">{{ mainCar.discount_price }}  {{$t('curr')}}</span>
                  <span>( {{ mainCar.price_after_tax }} {{ $t('curr') }} {{$t('taxx')}})</span>
                </div>
              </div>
              <div class="colors">
                <span class="word">{{$t('colorr')}}</span>
                <div class="main">
                  <span> {{ mainCar.color.title }} </span>
                </div>
              </div>

              <div class="btns">
                <a
                  href="#cash-payment-container"
                  @click="paymentType = 1"
                  class="cash"
                  >{{$t('cash')}}</a
                >
                <a href="#finance-payment-container" @click="paymentType = 2" class="finance">تمويل</a>
              </div>
            
            </div>
            </div>
          </div>
        </div>
      </div>
      <div class="details">
        <div class="text-center">
          <h2>{{$t('dett')}}</h2>
        </div>
        <div class="row">
          <div class="col-6 col-xl-2 col-lg-2 col-lg-4">
            <div class="box">
              <div class="icon">
                <img src="@/assets/images/s1.svg" alt="" />
              </div>
              <span class="label">{{$t('engine')}}</span>
              <span class="type">{{ mainCar.gear_shifter }}</span>
            </div>
          </div>
          <div class="col-6 col-xl-2 col-lg-2 col-lg-4">
            <div class="box">
              <div class="icon">
                <img src="@/assets/images/s2.svg" alt="" />
              </div>
              <span class="label"> {{ $t('gaz') }} </span>
              <span class="type">{{ mainCar.fuel_type }}</span>
            </div>
          </div>
          <div class="col-6 col-xl-2 col-lg-2 col-lg-4">
            <div class="box">
              <div class="icon">
                <img src="@/assets/images/s3.svg" alt="" />
              </div>
              <span class="label">سنة الصنع</span>
              <span class="type">{{ mainCar.year }}</span>
            </div>
          </div>
          <div class="col-6 col-xl-2 col-lg-2 col-lg-4">
            <div class="box">
              <div class="icon">
                <img src="@/assets/images/s4.svg" alt="" />
              </div>
              <span class="label">{{$t('road')}}</span>
              <span class="type">{{ mainCar.kilometer ? mainCar.kilometer : 0 }} كم</span>
            </div>
          </div>
          <div class="col-6 col-xl-2 col-lg-2 col-lg-4">
            <div class="box">
              <div class="icon">
                <img src="@/assets/images/s5.svg" alt="" />
              </div>
              <span class="label">{{ $t('tra') }}</span>
              <span class="type">{{ mainCar.supplier }}</span>
            </div>
          </div>
          <div class="col-6 col-xl-2 col-lg-2 col-lg-4">
            <div class="box">
              <div class="icon">
                <img src="@/assets/images/s6.svg" alt="" />
              </div>
              <span class="label">{{ $t('adNum') }}</span>
              <span class="type">{{ mainCar.id }}</span>
            </div>
          </div>
        </div>
      </div>

      <div
        :class="{
          'd-none': paymentIndividualBtn == 6 || paymentIndividualBtn == 7,
        }"
        class="paymentType"
      >
        <div
          id="cash-payment-container"
          v-if="paymentType == 1"
          class="payment-container"
        >
        <div class="textt">
          <h4>{{$t('cash')}}</h4>
          <span class="word">
            {{ $t('cash1') }}
          </span>
        
        </div>

          <div class="payment-method">
            <button
              @click="paymentMethod2 = 1"
              :class="{ active: paymentMethod2 == 1 }"
              class="one"
            >
              {{$t('ind')}}
            </button>
            <button
              @click="paymentMethod2 = 2"
              :class="{ active: paymentMethod2 == 2 }"
              class="two"
            >
              {{$t('comp')}}
            </button>
          </div>

          <div v-if="paymentMethod2 == 1" class="row">
            <div class="col-12 col-xl-8 col-lg-8">
              <div class="form-ind">
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> {{$t('name1')}} </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : تويوتا"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                  <div class="input-container">
                    <span> {{$t('phone')}} </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="+021093051515"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <button
                  @click="(paymentIndividualBtn = 6), (showConfirm = true)"
                >
                  {{$t('send')}}
                </button>
              </div>
            </div>
            <div class="col-12 col-xl-4 col-lg-4" style="position: relative">
              <div class="info-data">
                <h4>{{$t('info1')}}</h4>
                <p>{{$t('info2')}}</p>
                <div class="icons">
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <path
                        d="M20.0002 10.999H22.0002C22.0002 5.869 18.1272 2 12.9902 2V4C17.0522 4 20.0002 6.943 20.0002 10.999Z"
                        fill="#90A3BF"
                      />
                      <path
                        d="M13.0003 7.99999C15.1033 7.99999 16.0003 8.89699 16.0003 11H18.0003C18.0003 7.77499 16.2253 5.99999 13.0003 5.99999V7.99999ZM16.4223 13.443C16.2301 13.2683 15.9776 13.1752 15.7181 13.1832C15.4585 13.1912 15.2123 13.2998 15.0313 13.486L12.6383 15.947C12.0623 15.837 10.9043 15.476 9.71228 14.287C8.52028 13.094 8.15928 11.933 8.05228 11.361L10.5113 8.96699C10.6977 8.78612 10.8064 8.53982 10.8144 8.2802C10.8225 8.02059 10.7292 7.76804 10.5543 7.57599L6.85928 3.51299C6.68432 3.32035 6.44116 3.2035 6.18143 3.18725C5.92171 3.17101 5.66588 3.25665 5.46828 3.42599L3.29828 5.28699C3.12539 5.46051 3.0222 5.69145 3.00828 5.93599C2.99328 6.18599 2.70728 12.108 7.29928 16.702C11.3053 20.707 16.3233 21 17.7053 21C17.9073 21 18.0313 20.994 18.0643 20.992C18.3088 20.9783 18.5396 20.8747 18.7123 20.701L20.5723 18.53C20.7417 18.3325 20.8276 18.0768 20.8115 17.817C20.7954 17.5573 20.6788 17.3141 20.4863 17.139L16.4223 13.443Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span>+1012 3456 789</span>
                  </div>
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="20"
                      height="18"
                      viewBox="0 0 20 18"
                      fill="none"
                    >
                      <path
                        d="M15 0.5H5C2 0.5 0 2 0 5.5V12.5C0 16 2 17.5 5 17.5H15C18 17.5 20 16 20 12.5V5.5C20 2 18 0.5 15 0.5ZM15.47 6.59L12.34 9.09C11.68 9.62 10.84 9.88 10 9.88C9.16 9.88 8.31 9.62 7.66 9.09L4.53 6.59C4.21 6.33 4.16 5.85 4.41 5.53C4.67 5.21 5.14 5.15 5.46 5.41L8.59 7.91C9.35 8.52 10.64 8.52 11.4 7.91L14.53 5.41C14.85 5.15 15.33 5.2 15.58 5.53C15.84 5.85 15.79 6.33 15.47 6.59Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span>demo@gmail.com</span>
                  </div>
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <path
                        d="M12 1.5C9.81276 1.50258 7.71584 2.3726 6.16923 3.91922C4.62261 5.46584 3.75259 7.56276 3.75001 9.75C3.74739 11.5374 4.33124 13.2763 5.41201 14.7C5.41201 14.7 5.63701 14.9963 5.67376 15.039L12 22.5L18.3293 15.0353C18.3623 14.9955 18.588 14.7 18.588 14.7L18.5888 14.6978C19.669 13.2747 20.2526 11.5366 20.25 9.75C20.2474 7.56276 19.3774 5.46584 17.8308 3.91922C16.2842 2.3726 14.1873 1.50258 12 1.5ZM12 12.75C11.4067 12.75 10.8266 12.5741 10.3333 12.2444C9.83995 11.9148 9.45543 11.4462 9.22837 10.8981C9.00131 10.3499 8.9419 9.74667 9.05765 9.16473C9.17341 8.58279 9.45913 8.04824 9.87869 7.62868C10.2982 7.20912 10.8328 6.9234 11.4147 6.80764C11.9967 6.69189 12.5999 6.7513 13.1481 6.97836C13.6962 7.20542 14.1648 7.58994 14.4944 8.08329C14.8241 8.57664 15 9.15666 15 9.75C14.999 10.5453 14.6826 11.3078 14.1202 11.8702C13.5578 12.4326 12.7954 12.749 12 12.75Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span
                      >المملكة العربية السعودية - شارع الوحدة - الوحدة
                      الخامسة</span
                    >
                  </div>
                </div>
              </div>
            </div>
          </div>
          <div v-if="paymentMethod2 == 2" class="row">
            <div class="col-12 col-xl-8 col-lg-8">
              <div class="form-ind">
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> {{ $t('name3') }}</span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : تويوتا"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> نوع المنشأة </span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="مثال : شركة"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> رقم السجل التجاري</span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : 3333-5555-9999-55"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> نشاط المنشأة </span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="تأجير سيارات"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> اسم الشخص المسؤول </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : محمد سيد"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> رقم الهاتف </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : 3333-5555-9999-55"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> عمر المنشأة </span>
                    <div class="input">
                      <input
                        type="number"
                        min="1"
                        placeholder="مثال : 4 سنوات"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> المدينة </span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="ابها"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> حساب المنشأة لدي البنك</span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="مثال : مصرف الجارحي"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>

                  <div class="input-container">
                    <span> عدد السيارات المطلوبة</span>
                    <div class="input">
                      <input
                        type="number"
                        min="1"
                        placeholder="3 سيارات"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <button
                  @click="(paymentIndividualBtn = 6), (showConfirm = true)"
                >
                  {{$t('send')}}
                </button>
              </div>
            </div>
            <div class="col-12 col-xl-4 col-lg-4" style="position: relative">
              <div class="info-data">
                <h4>{{$t('info1')}}</h4>
                <p>{{$t('info2')}}</p>
                <div class="icons">
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <path
                        d="M20.0002 10.999H22.0002C22.0002 5.869 18.1272 2 12.9902 2V4C17.0522 4 20.0002 6.943 20.0002 10.999Z"
                        fill="#90A3BF"
                      />
                      <path
                        d="M13.0003 7.99999C15.1033 7.99999 16.0003 8.89699 16.0003 11H18.0003C18.0003 7.77499 16.2253 5.99999 13.0003 5.99999V7.99999ZM16.4223 13.443C16.2301 13.2683 15.9776 13.1752 15.7181 13.1832C15.4585 13.1912 15.2123 13.2998 15.0313 13.486L12.6383 15.947C12.0623 15.837 10.9043 15.476 9.71228 14.287C8.52028 13.094 8.15928 11.933 8.05228 11.361L10.5113 8.96699C10.6977 8.78612 10.8064 8.53982 10.8144 8.2802C10.8225 8.02059 10.7292 7.76804 10.5543 7.57599L6.85928 3.51299C6.68432 3.32035 6.44116 3.2035 6.18143 3.18725C5.92171 3.17101 5.66588 3.25665 5.46828 3.42599L3.29828 5.28699C3.12539 5.46051 3.0222 5.69145 3.00828 5.93599C2.99328 6.18599 2.70728 12.108 7.29928 16.702C11.3053 20.707 16.3233 21 17.7053 21C17.9073 21 18.0313 20.994 18.0643 20.992C18.3088 20.9783 18.5396 20.8747 18.7123 20.701L20.5723 18.53C20.7417 18.3325 20.8276 18.0768 20.8115 17.817C20.7954 17.5573 20.6788 17.3141 20.4863 17.139L16.4223 13.443Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span>+1012 3456 789</span>
                  </div>
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="20"
                      height="18"
                      viewBox="0 0 20 18"
                      fill="none"
                    >
                      <path
                        d="M15 0.5H5C2 0.5 0 2 0 5.5V12.5C0 16 2 17.5 5 17.5H15C18 17.5 20 16 20 12.5V5.5C20 2 18 0.5 15 0.5ZM15.47 6.59L12.34 9.09C11.68 9.62 10.84 9.88 10 9.88C9.16 9.88 8.31 9.62 7.66 9.09L4.53 6.59C4.21 6.33 4.16 5.85 4.41 5.53C4.67 5.21 5.14 5.15 5.46 5.41L8.59 7.91C9.35 8.52 10.64 8.52 11.4 7.91L14.53 5.41C14.85 5.15 15.33 5.2 15.58 5.53C15.84 5.85 15.79 6.33 15.47 6.59Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span>demo@gmail.com</span>
                  </div>
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <path
                        d="M12 1.5C9.81276 1.50258 7.71584 2.3726 6.16923 3.91922C4.62261 5.46584 3.75259 7.56276 3.75001 9.75C3.74739 11.5374 4.33124 13.2763 5.41201 14.7C5.41201 14.7 5.63701 14.9963 5.67376 15.039L12 22.5L18.3293 15.0353C18.3623 14.9955 18.588 14.7 18.588 14.7L18.5888 14.6978C19.669 13.2747 20.2526 11.5366 20.25 9.75C20.2474 7.56276 19.3774 5.46584 17.8308 3.91922C16.2842 2.3726 14.1873 1.50258 12 1.5ZM12 12.75C11.4067 12.75 10.8266 12.5741 10.3333 12.2444C9.83995 11.9148 9.45543 11.4462 9.22837 10.8981C9.00131 10.3499 8.9419 9.74667 9.05765 9.16473C9.17341 8.58279 9.45913 8.04824 9.87869 7.62868C10.2982 7.20912 10.8328 6.9234 11.4147 6.80764C11.9967 6.69189 12.5999 6.7513 13.1481 6.97836C13.6962 7.20542 14.1648 7.58994 14.4944 8.08329C14.8241 8.57664 15 9.15666 15 9.75C14.999 10.5453 14.6826 11.3078 14.1202 11.8702C13.5578 12.4326 12.7954 12.749 12 12.75Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span
                      >المملكة العربية السعودية - شارع الوحدة - الوحدة
                      الخامسة</span
                    >
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div
          id="finance-payment-container"
          v-if="paymentType == 2"
          class="payment-container cash"
        >
        <div class="textt">
          <h4>التمويل</h4>
          <span class="word">
            قم بإتمام عمليتك بشكل سلس وفوري مع السداد النقدي
          </span>
        </div>

          <div class="payment-method">
            <button
              @click="paymentMethod = 1"
              class="one"
              :class="{ active: paymentMethod == 1 }"
            >
              افراد
            </button>
            <button
              @click="paymentMethod = 2"
              class="two"
              :class="{ active: paymentMethod == 2 }"
            >
              شركات
            </button>
          </div>

          <!-- <div v-if="paymentIndividualBtn == 4" class="offers h-50">
              <div  v-if="pending"  class="d-flex justify-content-center align-items-center h-100">
            <Vue3Lottie  :animation-data="loader" :height="180" :width="180" />
              </div>
               
              <v-radio-group  v-if="!pending"  >
                  <div class="row">
                    <div v-for="offer,index in bankOffers.banks" class="col-6">
                      <label :for="`offer-id-${index}`" class="offer w-100">
                        <div
                          class="d-flex align-items-center justify-content-between w-100"
                        >
                          <span v-if="offer.bank_offer == null" class="name">{{ offer.bank.name }}</span>
                          <span class="name" v-else>{{ offer.bank_offer }}</span>
                          <v-radio
                            class="radio-input"
                            :id="`offer-id-${index}`"
                            color="#DCB63B"
                            name="offer-id"
                            :value="offer.id"
                          ></v-radio>
                        </div>
                        <div class="price">
                          <h4>14,340 ريال</h4>
                          <span> اجمالي مبلغ التمويل </span>
                        </div>
                        <v-divider></v-divider>
                        <div class="details">
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det1.png" alt="" />
                              <span class="name">القسط الشهري</span>
                            </div>
                            <p class="price">{{ offer.monthly_installment }}  رس</p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det2.png" alt="" />
                              <span class="name">الدفعة الاولي</span>
                            </div>
                            <p class="price">{{ bankOffers.first_installment }}  رس</p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det3.png" alt="" />
                              <span class="name">مدة الاقساط</span>
                            </div>
                            <p class="price">{{ bankOffers.years }}</p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det4.png" alt="" />
                              <span class="name">الدفعة الاخيرة</span>
                            </div>
                            <p class="price">{{ bankOffers.last_installment }}  رس</p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det5.png" alt="" />
                              <span class="name">الرسوم الادارية</span>
                            </div>
                            <p class="price">{{ offer.administrative_fees }}  رس</p>
                          </div>
                        </div>
                      </label>
                    </div>
               
                  </div>
                </v-radio-group>
                <div v-if="!pending"  class="btns">
                  <button @click="paymentIndividualBtn = 3" class="back">
                    الرجوع
                  </button>
                  <button @click="paymentIndividualBtn = 5" class="next">
                    التالي
                  </button>
                </div>
              </div> -->

          <div v-if="paymentMethod == 1" class="row">
            <div class="col-12 col-xl-5 col-lg-5">
              <div class="main-pagination-container">
                <div class="pagination-container">
                <div class="contain">
                  <div
                    class="icon"
                    :class="{ active: paymentBtn1 == 1 }"
                  >
                    <img
                      class="def"
                      src="@/assets/images/calc-icon1.svg"
                      alt=""
                    />
                    <img
                      class="active"
                      src="@/assets/images/calc-icon-active1.svg"
                      alt=""
                    />
                    
                  </div>
                  <div
                    class="icon"
                    :class="{ active: paymentBtn2 == 1 }"
                  >
                    <img
                      class="def"
                      src="@/assets/images/calc-icon2.svg"
                      alt=""
                    />
                    <img
                      class="active"
                      src="@/assets/images/calc-icon-active2.svg"
                      alt=""
                    />
                  </div>
                  <div
                    class="icon"
                    :class="{ active: paymentBtn3 == 1 }"
                  >
                    <img
                      class="def"
                      src="@/assets/images/calc-icon3.svg"
                      alt=""
                    />
                    <img
                      class="active"
                      src="@/assets/images/calc-icon-active3.svg"
                      alt=""
                    />
                  </div>
                  <div
                    class="icon"
                    :class="{ active: paymentBtn4 == 1 }"
                  >
                    <img
                      class="def"
                      src="@/assets/images/calc-icon4.svg"
                      alt=""
                    />
                    <img
                      class="active"
                      src="@/assets/images/calc-icon-active4.svg"
                      alt=""
                    />
                  </div>
                  <div
                    class="icon"
                    :class="{ active: paymentBtn5 == 1 }"
                  >
                    <img
                      class="def"
                      src="@/assets/images/calc-icon5.svg"
                      alt=""
                    />
                    <img
                      class="active"
                      src="@/assets/images/calc-icon-active5.svg"
                      alt=""
                    />
                  </div>
                
                </div>
                <div class="text">
                  <div>
                    <h5 :class="{ active: paymentBtn1 == 1 }">
                      خيارات التمويل
                    </h5>
                  </div>
                  <div>
                    <h5 :class="{ active: paymentBtn2 == 1 }">
                      بيانات السيارة
                    </h5>
                  </div>
                  <div>
                    <h5 :class="{ active: paymentBtn3 == 1 }">
                      البيانات الشخصية
                    </h5>
                  </div>
                  <div>
                    <h5 :class="{ active: paymentBtn4 == 1 }">
                      العروض
                    </h5>
                  </div>
                  <div >
                    <h5 :class="{ active: paymentBtn5 == 1 }">اكمال الطلب</h5>
                  </div>
                </div>
                </div>
                <div class="content-pagination">
                  <div>
                    <h5 :class="{ active: paymentBtn1 == 1 }">
                      خيارات التمويل
                    </h5>
                    <span> هذا النص هو مثال حي يمكن ان يستبدل في </span>
                  </div>
                  <div>
                    <h5 :class="{ active: paymentBtn2 == 1 }">
                      بيانات السيارة
                    </h5>
                    <span> هذا النص هو مثال حي يمكن ان يستبدل في </span>
                  </div>
                  <div>
                    <h5 :class="{ active: paymentBtn3 == 1 }">
                      البيانات الشخصية
                    </h5>
                    <span> هذا النص هو مثال حي يمكن ان يستبدل في </span>
                  </div>
                  <div>
                    <h5 :class="{ active: paymentBtn4 == 1 }">
                      العروض
                    </h5>
                    <span> هذا النص هو مثال حي يمكن ان يستبدل في </span>
                  </div>
                  <div >
                    <h5 :class="{ active: paymentBtn5 == 1 }">اكمال الطلب</h5>
                    <span> هذا النص هو مثال حي يمكن ان يستبدل في </span>
                  </div>
                </div>
                <div class="pagination-container ">
                <div class="contain second">
                  <div
                    class="dot"
                    :class="{ active: paymentBtn1 == 1 , check: checkBtn1 == 1 }"
                  >
                    <i class="fa-solid fa-check"></i>
                  </div>
                  <div
                    class="dot"
                    :class="{ active: paymentBtn2 == 1 , check: checkBtn2 == 1}"
                  >
                    <i class="fa-solid fa-check"></i>
                  </div>
                  <div
                    class="dot"
                    :class="{ active: paymentBtn3 == 1 , check: checkBtn3 == 1}"
                  >
                    <i class="fa-solid fa-check"></i>
                  </div>
                  <div
                    class="dot"
                    :class="{ active: paymentBtn4 == 1 , check: checkBtn4 == 1}"
                  >
                    <i class="fa-solid fa-check"></i>
                  </div>
                  <div
                    class="dot"
                    :class="{ active: paymentBtn5 == 1 , check: checkBtn5 == 1}"
                  >
                    <i class="fa-solid fa-check"></i>
                  </div>
                
                </div>
                </div>
              </div>
            </div>
            <div class="col-12 col-xl-7 col-lg-7">
              <div v-if="paymentIndividualBtn == 1" class="range-container">
                <div class="d-flex flex-column range-slider">
                  <span class="word"> المقدم </span>
                  <v-slider
                    v-model="sliderValue1"
                    min="100000"
                    max="500000"
                    step="10000"
                    thumb-label="always"
                    class="custom-slider mt-5"
                    @input="updateRange()"
                    :reverse="slide"
                  >
                    <template v-slot:thumb-label="{ value }">
                      <div class="d-flex align-items-center gap-2">
                        <span> ر.س </span>
                        {{ sliderValue1 }}
                      </div>
                    </template>
                  </v-slider>
                </div>
                <div class="d-flex flex-column range-slider">
                  <span class="word">مدة التقسيط</span>
                  <v-slider
                    v-model="sliderValue2"
                    min="1"
                    max="160"
                    step="1"
                    thumb-label="always"
                    class="custom-slider mt-5"
                    @input="updateRange()"
                    :reverse="slide"
                  >
                    <template v-slot:thumb-label="{ value }">
                      <div class="d-flex align-items-center gap-2">
                        <span> شهر </span>
                        {{ sliderValue2 }}
                      </div>
                    </template>
                  </v-slider>
                </div>
                <div class="d-flex flex-column range-slider">
                  <span class="word"> الدفعة الاخيرة </span>
                  <v-slider
                    v-model="sliderValue2"
                    min="1"
                    max="160"
                    step="1"
                    thumb-label="always"
                    class="custom-slider mt-5"
                    @input="updateRange()"
                    :reverse="slide"
                  >
                    <template v-slot:thumb-label="{ value }">
                      <div class="d-flex align-items-center gap-2">
                        <span> شهر </span>
                        {{ sliderValue2 }}
                      </div>
                    </template>
                  </v-slider>
                </div>

                <div class="total-container">
                  <div
                    class="w-100 d-flex align-items-center justify-content-between"
                  >
                    <span> الدفعة الاولي </span>
                    <span> 500,000 رس </span>
                  </div>
                  <div
                    class="w-100 d-flex align-items-center justify-content-between"
                  >
                    <span> مدة التقسيط </span>
                    <span> 10% </span>
                  </div>
                  <div
                    class="w-100 d-flex align-items-center justify-content-between"
                  >
                    <span>الدفعة الاخيرة</span>
                    <span> 30% </span>
                  </div>
                </div>
                <div class="d-flex justify-content-center justify-content-xl-end justify-content-lg-end">
                  <button @click="paymentIndividualBtn = 2 , paymentFunc1()" class="next-step">
                    التالي
                  </button>
                </div>
              </div>

              <div
                v-if="paymentIndividualBtn == 2"
                class="d-flex flex-column gap-4"
              >
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> ماركة السيارة </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : تويوتا"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                  <div class="input-container">
                    <span> نوع السيارة </span>
                    <div class="input">
                      <input type="text" name="" value="" class="" />
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> موديل السيارة </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : تويوتا"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                  <div class="input-container">
                    <span> المواصفات </span>
                    <div class="input">
                      <input type="text" name="" value="" class="" />
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span>اللون</span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : تويوتا"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <div class="btns">
                  <button @click="paymentIndividualBtn = 1" class="back">
                    الرجوع
                  </button>
                  <button @click="paymentIndividualBtn = 3 , paymentFunc2()" class="next">
                    التالي
                  </button>
                </div>
              </div>
              <div
                v-if="paymentIndividualBtn == 3"
                class="d-flex flex-column gap-4"
              >
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> اسم العميل </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="خالد سوادة"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                  <div class="input-container">
                    <span> رقم الجوال </span>
                    <div class="input">
                      <input type="tel" name="" value="" class="" />
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> رقم الهوية </span>
                    <div class="input">
                      <input
                        type="tel"
                        placeholder="مثال : 3333-5555-9999-55"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                  <div class="input-container">
                    <span> تاريخ الميلاد </span>
                    <div class="input">
                      <input type="date" name="" value="" class="" />
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span>جهة تحويل الراتب</span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="مثال : مصرف الجارحي"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                  <div class="input-container">
                    <span>جهة العمل</span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="مثال : حكومي"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span>مبلغ الراتب</span>
                    <div class="input">
                      <input
                        type="number"
                        min="1"
                        placeholder="مثال : 25000 ر.س"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                  <div class="input-container">
                    <span> اجمالي الالتزامات الشهرية في سمة </span>
                    <div class="input">
                      <input
                        type="number"
                        min="1"
                        placeholder="مثال : 25000 ر.س"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> المدينة </span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="مثال : مصرف الجارحي"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                  <div class="input-container">
                    <div class="d-flex align-items-center gap-3">
                      <span> البريد الالكتروني</span>
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="20"
                        height="20"
                        viewBox="0 0 20 20"
                        fill="none"
                      >
                        <path
                          fill-rule="evenodd"
                          clip-rule="evenodd"
                          d="M18.3337 9.99999C18.3337 14.6024 14.6027 18.3333 10.0003 18.3333C5.39795 18.3333 1.66699 14.6024 1.66699 9.99999C1.66699 5.39762 5.39795 1.66666 10.0003 1.66666C14.6027 1.66666 18.3337 5.39762 18.3337 9.99999ZM10.8337 5.83332C10.8337 6.29356 10.4606 6.66666 10.0003 6.66666C9.54009 6.66666 9.16699 6.29356 9.16699 5.83332C9.16699 5.37309 9.54009 4.99999 10.0003 4.99999C10.4606 4.99999 10.8337 5.37309 10.8337 5.83332ZM9.16699 7.70832C8.82182 7.70832 8.54199 7.98815 8.54199 8.33332C8.54199 8.6785 8.82182 8.95832 9.16699 8.95832H9.37533V14.1667C9.37533 14.5118 9.65515 14.7917 10.0003 14.7917C10.3455 14.7917 10.6253 14.5118 10.6253 14.1667V8.33332C10.6253 7.98815 10.3455 7.70832 10.0003 7.70832H9.16699Z"
                          fill="#90A3BF"
                        />
                      </svg>
                    </div>
                    <div class="input">
                      <input
                        type="email"
                        placeholder="مثال : Demo@gmail.com"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <div
                  class="d-flex main-radio flex-column flex-xl-row flex-lg-row align-items-start align-items-xl-center align-items-lg-center w-100 justify-content-between"
                >
                  <div>
                    <span>هل يوجد تعثرات</span>
                    <v-radio-group>
                      <div class="d-flex">
                        <div class="d-flex align-items-center">
                          <label for="radio-1">نعم</label>
                          <v-radio
                            id="radio-1"
                            color="#DCB63B"
                            name="radio-1"
                            value="one"
                          ></v-radio>
                        </div>
                        <div class="d-flex align-items-center">
                          <label for="radio-2"> لا </label>
                          <v-radio
                            id="radio-2"
                            color="#DCB63B"
                            name="radio-1"
                            value="two"
                          ></v-radio>
                        </div>
                      </div>
                    </v-radio-group>
                  </div>
                  <div>
                    <span> هل يوجد مخالفات مرورية </span>
                    <v-radio-group>
                      <div class="d-flex">
                        <div class="d-flex align-items-center">
                          <label for="radio-1">نعم</label>
                          <v-radio
                            id="radio-1"
                            color="#DCB63B"
                            name="radio-1"
                            value="one"
                          ></v-radio>
                        </div>
                        <div class="d-flex align-items-center">
                          <label for="radio-2"> لا </label>
                          <v-radio
                            id="radio-2"
                            color="#DCB63B"
                            name="radio-1"
                            value="two"
                          ></v-radio>
                        </div>
                      </div>
                    </v-radio-group>
                  </div>
                  <div>
                    <span> هل يوجد رخصة القيادة </span>
                    <v-radio-group>
                      <div class="d-flex">
                        <div class="d-flex align-items-center">
                          <label for="radio-1">نعم</label>
                          <v-radio
                            id="radio-1"
                            color="#DCB63B"
                            name="radio-1"
                            value="one"
                          ></v-radio>
                        </div>
                        <div class="d-flex align-items-center">
                          <label for="radio-2"> لا </label>
                          <v-radio
                            id="radio-2"
                            color="#DCB63B"
                            name="radio-1"
                            value="two"
                          ></v-radio>
                        </div>
                      </div>
                    </v-radio-group>
                  </div>
                  <div>
                    <span>هل يوجد قرض عقاري ( اختياري )</span>
                    <v-radio-group>
                      <div class="d-flex">
                        <div class="d-flex align-items-center">
                          <label for="radio-1">نعم</label>
                          <v-radio
                            id="radio-1"
                            color="#DCB63B"
                            name="radio-1"
                            value="one"
                          ></v-radio>
                        </div>
                        <div class="d-flex align-items-center">
                          <label for="radio-2"> لا </label>
                          <v-radio
                            id="radio-2"
                            color="#DCB63B"
                            name="radio-1"
                            value="two"
                          ></v-radio>
                        </div>
                      </div>
                    </v-radio-group>
                  </div>
                </div>
                <div class="btns">
                  <button @click="paymentIndividualBtn = 2" class="back">
                    الرجوع
                  </button>
                  <button
                    @click="(paymentIndividualBtn = 4) , paymentFunc3()"
                    class="next"
                  >
                    التالي
                  </button>
                </div>
              </div>

              <div v-if="paymentIndividualBtn == 4" class="offers h-50">
                <!-- <div
                  v-if="pending"
                  class="d-flex justify-content-center align-items-center h-100"
                >
                  <Vue3Lottie
                    :animation-data="loader"
                    :height="180"
                    :width="180"
                  />
                </div> -->
                <!-- !pending -->
                <!-- bankOffers.banks -->
                <v-radio-group >
                  <div class="row">
                    <div
                      v-for="(offer, index) in 4"
                      class="col-12 col-xl-6 col-lg-6"
                    >
                      <label :for="`offer-id-${index}`" class="offer w-100">
                        <div
                          class="d-flex align-items-center justify-content-between w-100"
                        >
                          <!-- <span v-if="offer.bank_offer == null" class="name">{{
                            offer.bank.name
                          }}</span> -->
                          <span v-if="offer.bank_offer == null" class="name">asjkhdasd</span>
                          <!-- <span class="name" v-else>{{
                            offer.bank_offer
                          }}</span> -->
                          <v-radio
                            class="radio-input"
                            :id="`offer-id-${index}`"
                            color="#DCB63B"
                            name="offer-id"
                            :value="index"
                          ></v-radio>
                        </div>
                        <!-- <div class="price">
                          <h4>14,340 ريال</h4>
                          <span> اجمالي مبلغ التمويل </span>
                        </div> -->
                        <v-divider></v-divider>
                        <div class="details">
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det1.png" alt="" />
                              <span class="name">القسط الشهري</span>
                            </div>
                            <p class="price">
                              <!-- {{ offer.monthly_installment }} رس -->
                              dasd
                            </p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det2.png" alt="" />
                              <span class="name">الدفعة الاولي</span>
                            </div>
                            <p class="price">
                              <!-- {{ bankOffers.first_installment }} رس -->
                              fdsa
                            </p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det3.png" alt="" />
                              <span class="name">مدة الاقساط</span>
                            </div>
                            <!-- <p class="price">{{ bankOffers.years }}</p> -->
                            <p class="price">44654</p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det4.png" alt="" />
                              <span class="name">الدفعة الاخيرة</span>
                            </div>
                            <p class="price">
                              <!-- {{ bankOffers.last_installment }} رس -->
                              dsfsd
                            </p>
                          </div>
                          <div class="detail">
                            <div class="d-flex align-items-center gap-2">
                              <img src="~/assets/images/det5.png" alt="" />
                              <span class="name">الرسوم الادارية</span>
                            </div>
                            <p class="price">
                              <!-- {{ offer.administrative_fees }} رس -->
                              4354
                            </p>
                          </div>
                        </div>
                      </label>
                    </div>
                  </div>
                </v-radio-group>
                <!-- v-if="!pending" -->
                <div  class="btns">
                  <button @click="paymentIndividualBtn = 3" class="back">
                    الرجوع
                  </button>
                  <button @click="paymentIndividualBtn = 5 , paymentFunc4()" class="next">
                    التالي
                  </button>
                </div>
              </div>

              <div v-if="paymentIndividualBtn == 5" class="final-review">
                <div class="offer">
                  <span class="word">العرض</span>
                  <div class="main-container">
                    <div class="name-price">
                      <div class="d-flex main flex-column">
                        <span class="name">العرض</span>
                        <p class="type mt-2">عرض رقم : 562</p>
                      </div>
                      <div class="d-flex main flex-column">
                        <h6>14,340 ريال</h6>
                        <p class="type">اجمالي مبلغ التمويل</p>
                      </div>
                    </div>
                    <div class="offer-det">
                      <div class="d-flex align-items-start flex-column flex-xl-row flex-lg-row align-items-xl-center align-items-lg-center gap-3">
                        <div class="d-flex align-items-center gap-4">
                          <div class="d-flex align-items-center gap-2">
                            <img src="~/assets/images/det1.png" alt="" />
                            <span>القسط الشهري</span>
                          </div>
                          <h6>40,000 ريال سعودي</h6>
                        </div>
                        <div class="d-flex align-items-center gap-3">
                          <div class="d-flex align-items-center gap-2">
                            <img src="~/assets/images/det2.png" alt="" />
                            <span>الدفعة الاخيرة</span>
                          </div>
                          <h6>40,000 ريال سعودي</h6>
                        </div>
                      </div>
                      <div class="d-flex align-items-start flex-column flex-xl-row flex-lg-row align-items-xl-center align-items-lg-center gap-3">
                        <div class="d-flex align-items-center gap-3">
                          <div class="d-flex align-items-center gap-2">
                            <img src="~/assets/images/det3.png" alt="" />
                            <span> الدفعة الاولي </span>
                          </div>
                          <h6>40,000 ريال سعودي</h6>
                        </div>
                        <div class="d-flex align-items-center gap-3">
                          <div class="d-flex align-items-center gap-2">
                            <img src="~/assets/images/det4.png" alt="" />
                            <span>الرسوم الادارية</span>
                          </div>
                          <h6>40,000 ريال سعودي</h6>
                        </div>
                      </div>
                      <div class="d-flex align-items-start flex-column flex-xl-row flex-lg-row align-items-xl-center align-items-lg-center gap-3">
                        <div class="d-flex align-items-center gap-3">
                          <div class="d-flex align-items-center gap-2">
                            <img src="~/assets/images/det3.png" alt="" />
                            <span> مدة الاقساط </span>
                          </div>
                          <h6>40,000 ريال سعودي</h6>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
                <div class="offer">
                  <span class="word"> بيانات السيارة </span>
                  <div class="main-container">
                    <div class="img-container">
                      <div class="image">
                        <img src="~/assets/images/small-car.png" />
                      </div>
                      <div class="d-flex flex-column gap-2">
                        <h6>تويوتا كامري 2024</h6>
                        <span>كامري - GLX - رصاصي - 2024</span>
                      </div>
                    </div>
                  </div>
                </div>
                <div>
                  <div class="files-span">
                    <span class="f1">المرفقات</span>
                    <span class="f2">( اختياري )</span>
                  </div>
                  <div class="row">
                    <div class="col-6 col-xl-3 col-lg-3 col-md-4">
                      <label for="fileInput1" class="custom-file-upload">
                        <!-- <span>{{ buttonText }}</span> -->
                        <img src="~/assets/images/file1.png" />
                        <h6>صورة الهوية</h6>
                        <span>يمكنك تحميل المرفق بصيغة PDF أو JPG.</span>
                        <span v-if="selectedFileName1">{{
                          selectedFileName1
                        }}</span>
                        <input
                          type="file"
                          @change="handleFileChange1"
                          id="fileInput1"
                        />
                      </label>
                    </div>
                    <div class="col-6 col-xl-3 col-lg-3 col-md-4">
                      <label for="fileInput2" class="custom-file-upload">
                        <!-- <span>{{ buttonText }}</span> -->
                        <img src="~/assets/images/file2.png" />
                        <h6>صورة الرخصة</h6>
                        <span>يمكنك تحميل المرفق بصيغة PDF أو JPG.</span>
                        <span v-if="selectedFileName2">{{
                          selectedFileName2
                        }}</span>
                        <input
                          type="file"
                          @change="handleFileChange2"
                          id="fileInput2"
                        />
                      </label>
                    </div>
                    <div class="col-6 col-xl-3 col-lg-3 col-md-4">
                      <label for="fileInput3" class="custom-file-upload">
                        <!-- <span>{{ buttonText }}</span> -->
                        <img src="~/assets/images/file3.png" />
                        <h6>تعريف الراتب</h6>
                        <span>يمكنك تحميل المرفق بصيغة PDF أو JPG.</span>
                        <span v-if="selectedFileName3">{{
                          selectedFileName3
                        }}</span>
                        <input
                          type="file"
                          @change="handleFileChange3"
                          id="fileInput3"
                        />
                      </label>
                    </div>
                    <div class="col-6 col-xl-3 col-lg-3 col-md-4">
                      <label for="fileInput4" class="custom-file-upload">
                        <!-- <span>{{ buttonText }}</span> -->
                        <img src="~/assets/images/file4.png" />
                        <h6>برنت التأمينات</h6>
                        <span>يمكنك تحميل المرفق بصيغة PDF أو JPG.</span>
                        <span v-if="selectedFileName4">{{
                          selectedFileName4
                        }}</span>
                        <input
                          type="file"
                          @change="handleFileChange4"
                          id="fileInput4"
                        />
                      </label>
                    </div>
                  </div>
                  <div class="btns">
                    <button @click="paymentIndividualBtn = 4" class="back">
                      العودة للعروض
                    </button>
                    <button
                      @click="(paymentIndividualBtn = 6), (showConfirm = true)"
                      class="next"
                    >
                      ارسال الطلب
                    </button>
                  </div>
                </div>
              </div>
            </div>
          </div>
          <div v-if="paymentMethod == 2" class="row">
            <div class="col-12 col-xl-8 col-lg-8">
              <div class="form-ind">
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> اسم المنشأة</span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : تويوتا"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> نوع المنشأة </span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="مثال : شركة"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> رقم السجل التجاري</span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : 3333-5555-9999-55"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> نشاط المنشأة </span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="تأجير سيارات"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> اسم الشخص المسؤول </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : محمد سيد"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> رقم الهاتف </span>
                    <div class="input">
                      <input
                        type="text"
                        placeholder="مثال : 3333-5555-9999-55"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> عمر المنشأة </span>
                    <div class="input">
                      <input
                        type="number"
                        min="1"
                        placeholder="مثال : 4 سنوات"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>

                  <div class="input-container">
                    <span> المدينة </span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="ابها"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>
                </div>
                <div class="d-flex flex-column flex-xl-row flex-lg-row gap-3">
                  <div class="input-container">
                    <span> حساب المنشأة لدي البنك</span>
                    <div class="input">
                      <Dropdown
                        v-model="selectedCountry"
                        :options="countries"
                        filter
                        optionLabel="name"
                        placeholder="مثال : مصرف الجارحي"
                        class=""
                      >
                        <template #option="slotProps">
                          <div class="flex align-items-center">
                            <div>{{ slotProps.option.name }}</div>
                          </div>
                        </template>
                      </Dropdown>
                    </div>
                  </div>

                  <div class="input-container">
                    <span> عدد السيارات المطلوبة</span>
                    <div class="input">
                      <input
                        type="number"
                        min="1"
                        placeholder="3 سيارات"
                        name=""
                        value=""
                        class=""
                      />
                    </div>
                  </div>
                </div>
                <button
                  @click="(paymentIndividualBtn = 6), (showConfirm = true)"
                >
                  ارسال الطلب
                </button>
              </div>
            </div>
            <div class="col-12 col-xl-4 col-lg-4" style="position: relative">
              <div class="info-data">
                <h4>معلومات الاتصال</h4>
                <p>سيتم الرد عليكم خلال مدة اقصاها 24 ساعة .</p>
                <div class="icons">
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <path
                        d="M20.0002 10.999H22.0002C22.0002 5.869 18.1272 2 12.9902 2V4C17.0522 4 20.0002 6.943 20.0002 10.999Z"
                        fill="#90A3BF"
                      />
                      <path
                        d="M13.0003 7.99999C15.1033 7.99999 16.0003 8.89699 16.0003 11H18.0003C18.0003 7.77499 16.2253 5.99999 13.0003 5.99999V7.99999ZM16.4223 13.443C16.2301 13.2683 15.9776 13.1752 15.7181 13.1832C15.4585 13.1912 15.2123 13.2998 15.0313 13.486L12.6383 15.947C12.0623 15.837 10.9043 15.476 9.71228 14.287C8.52028 13.094 8.15928 11.933 8.05228 11.361L10.5113 8.96699C10.6977 8.78612 10.8064 8.53982 10.8144 8.2802C10.8225 8.02059 10.7292 7.76804 10.5543 7.57599L6.85928 3.51299C6.68432 3.32035 6.44116 3.2035 6.18143 3.18725C5.92171 3.17101 5.66588 3.25665 5.46828 3.42599L3.29828 5.28699C3.12539 5.46051 3.0222 5.69145 3.00828 5.93599C2.99328 6.18599 2.70728 12.108 7.29928 16.702C11.3053 20.707 16.3233 21 17.7053 21C17.9073 21 18.0313 20.994 18.0643 20.992C18.3088 20.9783 18.5396 20.8747 18.7123 20.701L20.5723 18.53C20.7417 18.3325 20.8276 18.0768 20.8115 17.817C20.7954 17.5573 20.6788 17.3141 20.4863 17.139L16.4223 13.443Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span>+1012 3456 789</span>
                  </div>
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="20"
                      height="18"
                      viewBox="0 0 20 18"
                      fill="none"
                    >
                      <path
                        d="M15 0.5H5C2 0.5 0 2 0 5.5V12.5C0 16 2 17.5 5 17.5H15C18 17.5 20 16 20 12.5V5.5C20 2 18 0.5 15 0.5ZM15.47 6.59L12.34 9.09C11.68 9.62 10.84 9.88 10 9.88C9.16 9.88 8.31 9.62 7.66 9.09L4.53 6.59C4.21 6.33 4.16 5.85 4.41 5.53C4.67 5.21 5.14 5.15 5.46 5.41L8.59 7.91C9.35 8.52 10.64 8.52 11.4 7.91L14.53 5.41C14.85 5.15 15.33 5.2 15.58 5.53C15.84 5.85 15.79 6.33 15.47 6.59Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span>demo@gmail.com</span>
                  </div>
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <path
                        d="M12 1.5C9.81276 1.50258 7.71584 2.3726 6.16923 3.91922C4.62261 5.46584 3.75259 7.56276 3.75001 9.75C3.74739 11.5374 4.33124 13.2763 5.41201 14.7C5.41201 14.7 5.63701 14.9963 5.67376 15.039L12 22.5L18.3293 15.0353C18.3623 14.9955 18.588 14.7 18.588 14.7L18.5888 14.6978C19.669 13.2747 20.2526 11.5366 20.25 9.75C20.2474 7.56276 19.3774 5.46584 17.8308 3.91922C16.2842 2.3726 14.1873 1.50258 12 1.5ZM12 12.75C11.4067 12.75 10.8266 12.5741 10.3333 12.2444C9.83995 11.9148 9.45543 11.4462 9.22837 10.8981C9.00131 10.3499 8.9419 9.74667 9.05765 9.16473C9.17341 8.58279 9.45913 8.04824 9.87869 7.62868C10.2982 7.20912 10.8328 6.9234 11.4147 6.80764C11.9967 6.69189 12.5999 6.7513 13.1481 6.97836C13.6962 7.20542 14.1648 7.58994 14.4944 8.08329C14.8241 8.57664 15 9.15666 15 9.75C14.999 10.5453 14.6826 11.3078 14.1202 11.8702C13.5578 12.4326 12.7954 12.749 12 12.75Z"
                        fill="#90A3BF"
                      />
                    </svg>
                    <span
                      >المملكة العربية السعودية - شارع الوحدة - الوحدة
                      الخامسة</span
                    >
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>

      <div v-if="showConfirm" class="confirm-container">
        <div v-if="paymentIndividualBtn == 6" class="confirm-text">
          <client-only>
            <Vue3Lottie :animation-data="otpp" :height="200" :width="200" />
          </client-only>
          <h4>تم ارسال الكود!</h4>
          <p>
            شكرًا لثقتك في كود كار! لضمان أمان معلوماتك وتأكيد طلبك، ارسلنا كود
            تحقق عبر رسالة نصية إلى رقم هاتفك المسجل. يرجى إدخال الكود في الخانة
            المخصصة أدناه
          </p>

          <v-otp-input v-model="otp" :length="4" placeholder="-"></v-otp-input>
          {{ otp }}
          <button class="resend">اعد ارسال الكود</button>

          <button @click="paymentIndividualBtn = 7" class="send">متابعة</button>
        </div>
        <div v-if="paymentIndividualBtn == 7" class="confirm-text">
          <client-only>
            <Vue3Lottie :animation-data="success" :height="200" :width="200" />
          </client-only>
          <h4>تم ارسال طلبك بنجاح!</h4>
          <p>
            تم إرسال طلبك بنجاح! يمكنك متابعة حالة الطلب وجميع التفاصيل المتعلقة
            به من خلال تتبع طلبك في الصفحة الرئيسية
          </p>

          <div class="order-number">
            <h5>رقم الطلب : <span>200715DXFMW0UD</span></h5>
            <img src="~/assets/images/Copy.png" />
          </div>

          <nuxt-link to="/">
            <button class="send home">الرجوع للرئيسية</button>
          </nuxt-link>
        </div>
      </div>

      <div
        class="modal fade"
        id="vendor-whatsapp-modal"
        tabindex="-1"
        aria-labelledby="logout-modal"
        aria-hidden="true"
      >
        <div class="modal-dialog">
          <div class="modal-content log-out-modal car">
          <img src="~/assets/images/whats.svg" />
            <h4>تواصل مع التاجر</h4>
            <p>للتواصل مع التاجر والحصول على مزيد من المعلومات عبر WhatsApp، انسخ الرابط التالي</p>
         
            <button class="close" data-bs-dismiss="modal" aria-label="Close">
            <i class=" fa-solid fa-xmark"></i>
            </button>
            <div class="btns1">
            <div class="copy">
               <a :href="mainCar.vendor.whatsapp_link" target="_blank" class="icon">
                <svg xmlns="http://www.w3.org/2000/svg" width="10" height="6" viewBox="0 0 10 6" fill="none">
  <path fill-rule="evenodd" clip-rule="evenodd" d="M9.08146 3.33146C9.26451 3.1484 9.26451 2.8516 9.08146 2.66854L6.58146 0.168544C6.3984 -0.0145143 6.1016 -0.0145144 5.91854 0.168544C5.73549 0.351602 5.73549 0.648398 5.91854 0.831457L7.61834 2.53125L1.25 2.53125C0.991116 2.53125 0.781249 2.74112 0.781249 3C0.781249 3.25888 0.991116 3.46875 1.25 3.46875L7.61834 3.46875L5.91854 5.16854C5.73549 5.3516 5.73549 5.6484 5.91854 5.83146C6.1016 6.01451 6.3984 6.01451 6.58146 5.83146L9.08146 3.33146Z" fill="#DCB63B"/>
</svg>
               </a>
              <span>{{`https://wa.me/${mainCar.vendor.phone}`}}</span>
            </div>
             <button data-bs-dismiss="modal" aria-label="Close">الرجوع</button>
            </div>
          </div>
        </div>
      </div>
      <div
        class="modal fade"
        id="vendor-phone-modal"
        tabindex="-1"
        aria-labelledby="logout-modal"
        aria-hidden="true"
      >
        <div class="modal-dialog">
          <div class="modal-content log-out-modal car">
          <img src="~/assets/images/Phone_Call_5_.svg" />
            <h4>تواصل مع التاجر</h4>
            <p>للتحدث مع التاجر والاستفسار عن تفاصيل السيارة أو الصفقة، يُرجى الاتصال بالرقم التالي: {{ mainCar.vendor.phone }}.</p>
         
            <button class="close" data-bs-dismiss="modal" aria-label="Close">
            <i class=" fa-solid fa-xmark"></i>
            </button>
            <div class="btns1">
            <div class="copy">
              <svg v-if="copyPhone" @click="copyToClipboard()" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
  <path fill-rule="evenodd" clip-rule="evenodd" d="M16.3417 6.2714V1.91992H9.11988C7.7944 1.91992 6.71988 2.99444 6.71988 4.31992V16.7999C6.71988 18.1254 7.7944 19.1999 9.11988 19.1999H18.7199C20.0454 19.1999 21.1199 18.1254 21.1199 16.7999V7.69566H17.8035C17.0003 7.69566 16.3417 7.06227 16.3417 6.2714ZM17.5764 2.48677C17.4967 2.38227 17.4041 2.2904 17.3017 2.21272V6.2714C17.3017 6.52352 17.5223 6.73566 17.8035 6.73566H20.8163L17.5764 2.48677ZM5.27988 22.0799H14.8799C16.041 22.0799 17.0095 21.2554 17.2319 20.1599H9.11988C7.26421 20.1599 5.75988 18.6556 5.75988 16.7999V4.79992H5.27988C3.9544 4.79992 2.87988 5.87444 2.87988 7.19992V19.6799C2.87988 21.0054 3.9544 22.0799 5.27988 22.0799Z" fill="#90A3BF"/>
</svg>
<i v-else class="fa-solid fa-check"></i>
              <span>{{ mainCar.vendor.phone }}</span>
            </div>
             <button data-bs-dismiss="modal" aria-label="Close">الرجوع</button>
            </div>
          </div>
        </div>
      </div>
      <div class="similar-cars">
        <div class="head">
          <h4>السيارات المشابهة</h4>
        </div>
        <!-- <div class="row">
          <div v-for="i in 5" class="col-12 col-xl-3 col-lg-3 col-md-6">
            <car-card />
          </div>
        </div> -->
        <swiper
            :navigation="{
          nextEl: '.slider-product1-next',
          prevEl: '.slider-product1-prev',
        }"
              :breakpoints="{
                '300': {
                  slidesPerView: 1.3,
                  spaceBetween: 30,
                },
                '768': {
                  slidesPerView: 3,
                  spaceBetween: 30,
                },
                '1024': {
                  slidesPerView: 4,
                  spaceBetween: 30,
                },
              }"
              :autoplay="{
                delay: 4500,
                disableOnInteraction: false,
              }"
              :modules="[SwiperNavigation, SwiperAutoplay]"
            >
              <swiper-slide v-for="item in RelatedCars">
                <car-card :car="item" />
              </swiper-slide>
            </swiper>

            <div v-if="RelatedCars.length >= 1" class="icons-arrow">
              <div class="icon slider-product1-next">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="16"
                  height="17"
                  viewBox="0 0 16 17"
                  fill="none"
                  class="arrow-icon"
                >
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M4.29289 1.3384C3.90237 1.72995 3.90237 2.36479 4.29289 2.75634L9.58579 8.06316L4.29289 13.37C3.90237 13.7615 3.90237 14.3964 4.29289 14.7879C4.68342 15.1795 5.31658 15.1795 5.70711 14.7879L11.7071 8.77213C12.0976 8.38058 12.0976 7.74574 11.7071 7.35419L5.70711 1.3384C5.31658 0.946851 4.68342 0.946851 4.29289 1.3384Z"
                    
                  />
                </svg>
              </div>
              <div class="icon slider-product1-prev">
                <svg class="arrow-icon" xmlns="http://www.w3.org/2000/svg" width="16" height="17" viewBox="0 0 16 17" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.7071 1.3384C12.0976 1.72995 12.0976 2.36479 11.7071 2.75634L6.41421 8.06316L11.7071 13.37C12.0976 13.7615 12.0976 14.3964 11.7071 14.7879C11.3166 15.1795 10.6834 15.1795 10.2929 14.7879L4.29289 8.77213C3.90237 8.38058 3.90237 7.74574 4.29289 7.35419L10.2929 1.3384C10.6834 0.946851 11.3166 0.946851 11.7071 1.3384Z" />
            </svg>
              </div>
            </div>
      </div>
    </div>
    <Loader v-if="pendingLoader"></Loader> 
  </div>
</template>

<script setup>
import VueEasyLightbox from "vue-easy-lightbox";
import Dropdown from "primevue/dropdown";
import loader from "~/assets/animations/Loader.json";
import otpp from "~/assets/animations/otp.json";
import success from "~/assets/animations/success.json";
import { Vue3Lottie } from "vue3-lottie";
import axios from 'axios';
const { locale } = useI18n();

let slide = ref(true);
let mainCar = ref(null);
let RelatedCars = ref([]);
if(locale.value == 'ar'){
  slide.value = true;
} else{
  slide.value = false;
}
let paymentMethod = ref(1);
let paymentMethod2 = ref(1);
let paymentType = ref(0);
let sliderValue1 = ref(340000);
let sliderValue2 = ref(40);
let sliderValue3 = ref(40);
let showConfirm = ref(false);
const selectedFileName1 = ref(null);
const selectedFileName2 = ref(null);
const selectedFileName3 = ref(null);
const selectedFileName4 = ref(null);
let otp = ref("");

let copyPhone = ref(true);

function copyToClipboard() {
    if (process.client) {
      copyPhone.value = false;
        const clipBoard = navigator.clipboard;
        clipBoard.writeText(mainCar.value.vendor.phone).then(() => {
        });

        setTimeout(() => {
          copyPhone.value = true;
        }, 1000);
    }

}


let options = ref({
  minimizable: false,
  playerSize: "standard",
  backgroundColor: "#fff",
  backgroundStyle: "color",
  theme: {
    controlsView: "standard",
    active: "light",
    light: {
      color: "#3D4852",
      backgroundColor: "#fff",
      opacity: "0.7",
    },
    dark: {
      color: "#fff",
      backgroundColor: "#202020",
      opacity: "0.7",
    },
  },
});
const handleFileChange1 = (event) => {
  selectedFileName1.value = event.target.files[0]?.name || null;
  console.log(selectedFileName1.value);
};
const handleFileChange2 = (event) => {
  selectedFileName2.value = event.target.files[0]?.name || null;
  console.log(selectedFileName2.value);
};
const handleFileChange3 = (event) => {
  selectedFileName3.value = event.target.files[0]?.name || null;
  console.log(selectedFileName3.value);
};
const handleFileChange4 = (event) => {
  selectedFileName4.value = event.target.files[0]?.name || null;
  console.log(selectedFileName4.value);
};
const selectedCountry = ref();
const countries = ref([
  { name: "Australia", code: "AU" },
  { name: "Brazil", code: "BR" },
  { name: "China", code: "CN" },
  { name: "Egypt", code: "EG" },
  { name: "France", code: "FR" },
  { name: "Germany", code: "DE" },
  { name: "India", code: "IN" },
  { name: "Japan", code: "JP" },
  { name: "Spain", code: "ES" },
  { name: "United States", code: "US" },
]);

let paymentIndividualBtn = ref(1);
let paymentBtn1 = ref(1);
let paymentBtn2 = ref(0);
let paymentBtn3 = ref(0);
let paymentBtn4 = ref(0);
let paymentBtn5 = ref(0);
let checkBtn1 = ref(0);
let checkBtn2 = ref(0);
let checkBtn3 = ref(0);
let checkBtn4 = ref(0);
let checkBtn5 = ref(0);


const paymentFunc1 = ()=>{
  paymentBtn2.value = 1;
  checkBtn1.value = 1
}
const paymentFunc2 = ()=>{
  paymentBtn3.value = 1;
  checkBtn2.value = 1
}
const paymentFunc3 = ()=>{
  paymentBtn4.value = 1;
  checkBtn3.value = 1
}
const paymentFunc4 = ()=> {
  paymentBtn5.value = 1;
  checkBtn4.value = 1
}

const updateRange = () => {
  //console.log('Slider value:', sliderValue.value);
};

const onFileChange = (e) => {
  var files = e.target.files || e.dataTransfer.files;
  if (!files.length) return;
  // cv.value = (files[0]);
};

let url = "http://192.168.1.30:3000/api/calculate-installments";
let calc = ref({
  brand_id: 1,
  model_id: 1,
  car_id: 1,
  bank_id: 5,
  sector_id: 1,
  gender: "female",
  transferred: 0,
  salary: 10000,
  commitments: 2000,
  installment: 5,
  first_installment: 5,
  last_installment: 25,
});
let pending = ref(false);
let bankOffers = ref([]);
const SendCar = async () => {
  pending.value = true;
  let formData = new FormData();
  formData.append("brand_id", calc.value.brand_id);
  formData.append("model_id", calc.value.model_id);
  formData.append("car_id", calc.value.car_id);
  formData.append("bank_id", calc.value.bank_id);
  formData.append("sector_id", calc.value.sector_id);
  formData.append("gender", calc.value.gender);
  formData.append("transferred", calc.value.transferred);
  formData.append("salary", calc.value.salary);
  formData.append("commitments", calc.value.commitments);
  formData.append("installment", calc.value.installment);
  formData.append("first_installment", calc.value.first_installment);
  formData.append("last_installment", calc.value.last_installment);
  const result = await fetch(url, {
    method: "POST",
    headers: {
      // "Accept": "application/json",
      // "Content-Type": "multipart/form-data",
      // 'Content-Language': `${lang.value}`
    },
    // body: JSON.stringify(calc.value),
    body: formData,
  })
    .then((response) => response.json())
    .then((json) => {
      pending.value = false;
      console.log(json);
      bankOffers.value = json;
    });
};
const thumbsSwiper = ref(null);

const setThumbsSwiper = (swiper) => {
  thumbsSwiper.value = swiper;
};


const contactArr = ref([]);
const getContactData =  async()=>{
    let result = await axios.get(`${getUrl()}/contact-us`,{
        headers:{
            "Content-Language": `${locale.value}`,
        }
    });
    if(result.status == 200){
     contactArr.value = result.data.data;
    }
}

const route = useRoute();
let pendingLoader = ref(false);
 

let id = ref(route.query.id);

watch(
  () => route.query.id,
  (newId) => {
    id.value = newId;
    getCar();
  }
);

const getCar = async ()=>{
  pendingLoader.value = true;
  let result = await axios.get(`${getUrl()}/car/${id.value}`,{
    headers: {
      "Content-Language": `${locale.value}`,
    },
  });

  if(result.status == 200){
    pendingLoader.value = false;
    mainCar.value = result.data.data.carDetails;
    RelatedCars.value = result.data.data.Relatedcars;
  }
}


// start lightbox images

const visibleRef = ref(false);
const indexRef = ref(0);
const imgsRef = ref([]);

const onShow = () => {
  visibleRef.value = true;
};
const showMultiple = () => {
  imgsRef.value = mainCar.value.images;
  indexRef.value = 0;
  onShow();
};
const onHide = () => (visibleRef.value = false);

// end lightbox images

onMounted(() => {
  getCar();
  getContactData();
});
</script>
